In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv("../data/processed/telco_churn_cleaned.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7032 entries, 0 to 7031
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   gender             7032 non-null   object
 1   SeniorCitizen      7032 non-null   int64
 2   Partner            7032 non-null   object
 3   Dependents         7032 non-null   object
 4   tenure             7032 non-null   int64
 5   PhoneService       7032 non-null   object
 6   MultipleLines      7032 non-null   object
 7   InternetService    7032 non-null   object
 8   OnlineSecurity     7032 non-null   object
 9   OnlineBackup       7032 non-null   object
 10  DeviceProtection   7032 non-null   object
 11  TechSupport        7032 non-null   object
 12  StreamingTV        7032 non-null   object
 13  StreamingMovies    7032 non-null   object
 14  Contract           7032 non-null   object
 15  PaperlessBilling   7032 non-null   object
 16  PaymentMethod      7032 non-null   object
 17  MonthlyCharges     7032 non-null   float64
 18  TotalCharges       7032 non-null   float64
 19  Churn              7032 non-null   int64
 20  MonthlyRevenue     7032 non-null   float64
 21  AnnualRevenue      7032 non-null   float64
 22  RevenueLost        7032 non-null   float64
 23  TenureGroup        7032 non-null   object
 24  HighValueCustomer  7032 non-null   int64
dtypes: float64(5), int64(4), object(16)
memory usage: 1.3+ MB

In [3]:
engine = create_engine(
    "mysql+pymysql://root:root@localhost:3306/revenue_leakage",
    echo=False
)

In [4]:
df.to_sql(
    name="telco_churn",
    con=engine,
    if_exists="replace",   # ðŸ‘ˆ THIS FIXES EVERYTHING
    index=False,
    chunksize=1000         # ðŸ‘ˆ avoids packet-size errors
)

7032

In [5]:
pd.read_sql("SELECT COUNT(*) FROM telco_churn", engine)

   COUNT(*)
0      7032